#include <iostream>
#include <cmath>

using namespace std;

int main() {
    setlocale(LC_ALL, "Russian");

    int a, b, c, P, S, p;// P - периметр, S - площадь, p - полупериметр

    cout << "Введите первую сторону треугольника ";
    cin >> a;
    cout << "Введите вторую сторону треугольника ";
    cin >> b;
    cout << "Введите третью сторону треугольника ";
    cin >> c;
    if ((a + b > c) && (a + c > b) && (b + c > a)) 
    {
        P = a+b+c;
        cout << " Периметр треугольника = " << P << endl;
        p = P / 2;
        S = sqrt(p*(p-a)*(p-b)*(p-c));//формула Герона
        cout << " Площадь тругольника = " << S << endl;
        if ((a == b) || (b == c) || (a == c))// доабвили какой -то коммент
        {
            if ((a == b) && (b == c)) 
            {
                cout << "Частный случай равнобедренности: треугольник равносторонний";
            }
            else 
            {
                cout << "Треугольник равнобедренный";
            }
        }
        else {
            cout << "Треугольник неравнобедренный";
        }
    }
    else
    {
        cout << "Треугольник не может существовать";
    }
    return 0;
}